chipKIT32/chipKIT32-MAX/hardware/pic32/libraries/DSPI/DSPI.cpp
/************************************************************************/
/*																		*/
/*	DSPI.cpp	--	Implementation for Digilent chipKIT SPI Library		*/
/*																		*/
/************************************************************************/
/*	Author: 	Gene Apperson											*/
/*	Copyright (c) 2011, Digilent Inc, All rights reserved				*/
/************************************************************************/
/*  Module Description: 												*/
/*																		*/
/* This is the main program module for the Digilent SPI library for use	*/
/* with the chipKIT system. This library supports access to all of the	*/
/* SPI ports defined on the board in use.								*/
/*																		*/
/************************************************************************/
/*  Revision History:													*/
/*																		*/
/*	10/28/2011(Gene Apperson): Created									*/
/*	05/27/2013(Claudia Goga) : Added PPS support for PIC32MX1/2			*/
/*																		*/
/************************************************************************/
/*
  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/
/************************************************************************/


/* ------------------------------------------------------------ */
/*				Include File Definitions						*/
/* ------------------------------------------------------------ */

#define OPT_BOARD_INTERNAL
#include	<sys/attribs.h>
#include	<DSPI.h>

#if defined(_SPI1CON_ENHBUF_POSITION)
#define ENH_BUFFER _SPI1CON_ENHBUF_POSITION
#elif defined(_SPI1ACON_ENHBUF_POSITION)
#define ENH_BUFFER _SPI1ACON_ENHBUF_POSITION
#endif

/* ------------------------------------------------------------ */
/*				Forward references to int handlers              */
/* ------------------------------------------------------------ */
extern "C" void __attribute__((interrupt(),nomips16)) IntDspi0Handler(void);
extern "C" void __attribute__((interrupt(),nomips16)) IntDspi1Handler(void);
extern "C" void __attribute__((interrupt(),nomips16)) IntDspi2Handler(void);
extern "C" void __attribute__((interrupt(),nomips16)) IntDspi3Handler(void);

/* ------------------------------------------------------------ */
/*				Local Type and Constant Definitions				*/
/* ------------------------------------------------------------ */


/* ------------------------------------------------------------ */
/*				Global Variables								*/
/* ------------------------------------------------------------ */


/* ------------------------------------------------------------ */
/*				Local Variables									*/
/* ------------------------------------------------------------ */

#if defined(_DSPI0_VECTOR)
static DSPI *	pdspi0 = 0;
#endif

#if defined(_DSPI1_VECTOR)
static DSPI *	pdspi1 = 0;
#endif

#if defined(_DSPI2_VECTOR)
static DSPI *	pdspi2 = 0;
#endif

#if defined(_DSPI3_VECTOR)
static DSPI *	pdspi3 = 0;
#endif

/* ------------------------------------------------------------ */
/*				Forward Declarations							*/
/* ------------------------------------------------------------ */


/* ------------------------------------------------------------ */
/*				Procedure Definitions							*/
/* ------------------------------------------------------------ */


/* ------------------------------------------------------------ */
/*				DSPI Object Class Implementation				*/
/* ------------------------------------------------------------ */
/*				Initialization and Setup Functions				*/
/* ------------------------------------------------------------ */
/***	DSPI::DSPI
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		DSPI constructor. This is private so that this object can't
**		be instantiated. Only objects from the derived classes
**		can be instantiated.
*/

#if defined(__PIC32MX1XX__) || defined(__PIC32MX2XX__) || defined(__PIC32MZXX__) || defined(__PIC32MX47X__)
DSPI::DSPI(int pinMI, int pinMO, ppsFunctionType ppsMI, ppsFunctionType ppsMO)
#else
DSPI::DSPI()
#endif
 {

	pspi = 0;
	cbCur = 0;

#if defined(__PIC32MX1XX__) || defined(__PIC32MX2XX__) || defined(__PIC32MZXX__) || defined(__PIC32MX47X__)
	pinMISO = (uint8_t)pinMI;
	pinMOSI = (uint8_t)pinMO;
	ppsMISO = ppsMI;
	ppsMOSI = ppsMO;
#endif

}

/* ------------------------------------------------------------ */
/***	DSPI::init
**
**	Parameters:
**		irqErr		- IRQ for the SPI error interrupt
**		irqRx		- IRQ for the SPI receive interrupt
**		irqTx		- IRQ for the SPI transmit interrupt
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Initialize the object. This is called from the constructors
**		of the derived classes.
*/

void
DSPI::init(uint8_t irqErr, uint8_t irqRx, uint8_t irqTx, isrFunc isrHandler) {

	/* The interrupt flag and enable control register addresses and
	** the bit numbers for the flag bits can be computed from the
	** IRQ numbers for the SPI port. There are 32 IRQ bits in each IFS
	** and IEC register. For each IFS register, there is a SET, CLR,
	** and INV register, so the distance (in dwords) from IFS0 to IFS1
	** is 4. This code assumes that all of the enable control and flag
	** bits for an SPI controller are in the same IEC and IFS registers.
	*/
	pregIec = ((p32_regset *)&IEC0) + (irqErr / 32);	// interrupt enable control register
	pregIfs = ((p32_regset *)&IFS0) + (irqErr / 32);	// interrupt flag register

	bitErr = 1 << (irqErr % 32);	// error interrupt flag/enable bit
	bitRx  = 1 << (irqRx % 32);		// rx interrupt flag/enable bit
	bitTx  = 1 << (irqTx % 32);		// tx interrupt flag/enable bit

    isr = isrHandler;
}

#if defined(__PIC32MX1XX__) || defined(__PIC32MX2XX__) || defined(__PIC32MZXX__) || defined(__PIC32MX47X__)

