chipKIT32/chipKIT32-MAX/hardware/pic32/libraries/DSPI/DSPI.cpp
/* ------------------------------------------------------------ */
/***	DSPI::begin
**
**	Parameters:
**		uint8_t miso - MISO pin PPS mapping
**      uint8_t mosi - MOSI pin PPS mapping
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Initialize the SPI port with new PPS mappings.
*/

void DSPI::begin(uint8_t miso, uint8_t mosi) {
    pinMISO = miso;
    pinMOSI = mosi;
    begin(pinSS);
}

/* ------------------------------------------------------------ */
/***	DSPI::begin
**
**	Parameters:
**		uint8_t miso - MISO pin PPS mapping
**      uint8_t mosi - MOSI pin PPS mapping
**      uint8_t ss   - Slace Select pin
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Initialize the SPI port with new PPS mappings.
*/
void DSPI::begin(uint8_t miso, uint8_t mosi, uint8_t ss) {
    pinMISO = miso;
    pinMOSI = mosi;
    pinSS = ss;
    begin(pinSS);
}
#endif

/* ------------------------------------------------------------ */
/***	DSPI::begin
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Initialize the SPI port with all default values.
*/

void
DSPI::begin() {

	/* Use the default pin specified in the constructor.
	*/
	begin(pinSS);

}

/* ------------------------------------------------------------ */
/***	DSPI::begin
**
**	Parameters:
**		pinT		- pin to use for SS instead of the default.
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Initialize the SPI port with the default values. This
**		will set the clock rate to the default speed and the
**		pin for SS to the specified pin.
*/

void
DSPI::begin(uint8_t pinT) {

	p32_regset *	pregIpc;
	int				bnVec;
	uint8_t			bTmp;
	uint16_t		brg;

#if defined(__PIC32MX1XX__) || defined(__PIC32MX2XX__) || defined(__PIC32MZXX__) || defined(__PIC32MX47X__)
	/* Map the SPI MISO to the appropriate pin.  Some chips need the
       pins to be set to the right mode, either for the IO functionality
       or to disable any analog on the pin.
	*/
    pinMode(pinMISO, INPUT);
    mapPps(pinMISO, ppsMISO);

	/* Map the SPI MOSI to the appropriate pin.
	*/
    pinMode(pinMOSI, OUTPUT);
    mapPps(pinMOSI, ppsMOSI);
#endif

    // set up the interrupt handler 
    setIntVector(vec, isr);

/* Initialize the pins. The pin directions for SDO, SDI and SCK
	** are set automatically when the SPI controller is enabled. The
	** SS pin isn't explicitly used by the SPI controller when in
	** master mode, so we need to initialize it ourselves.
	*/
	setPinSelect(pinT);

	/* Disable interrupts on this SPI controller.
	*/
	pregIec->clr = bitErr + bitRx + bitTx;

	/* Disable and reset the SPI controller.
	*/
	pspi->sxCon.reg = 0;

	/* Clear the receive buffer.
	*/
	bTmp = pspi->sxBuf.reg;

	/* Clear all SPI interrupt flags.
	*/
	pregIfs->clr = bitErr + bitRx + bitTx;

	/* Compute the address of the interrupt priority control register
	** used by this SPI controller.
	*/
	pregIpc = ((p32_regset *)&IPC0) + (vec / 4);	// interrupt priority control register

	/* Compute the bit position of the interrupt priority bits for
	** this interrupt vector.
	*/
	bnVec = 8 * (vec % 4);

	/* Set the interrupt priority and sub-priority bits.
	** The interrupt priorty control register address and the priority bits
	** can be computed from the vector number. Each IPC register contains the
	** the priority bits for four vectors. Each byte of an IPC registger contains
	** the priority and sub-priority bits arranged such that  bits 0-1 are
	** the sub-priority, bits 2-4 the priority, and bits 5-7 unused.
	*/
	pregIpc->clr = (0x1F << bnVec);
	pregIpc->set = ipl << bnVec;

	/* Set the default baud rate.
	*/
	brg = (uint16_t)((__PIC32_pbClk / (2 * _DSPI_SPD_DEFAULT)) - 1);
	pspi->sxBrg.reg = brg;

	/* Clear the receive overflow bit and receive overflow error flag
	*/
	pspi->sxStat.clr = (1 << _SPISTAT_SPIROV);
	fRov = 0;

	/* Enable the SPI controller.
	** Warning: if the SS pin ever becomes a LOW INPUT then SPI 
	** automatically switches to Slave, so the data direction of 
	** the SS pin MUST be kept as OUTPUT.
	*/
	pspi->sxCon.reg = 0;
	pspi->sxCon.set = (1 << _SPICON_ON) + (1 << _SPICON_MSTEN) + DSPI_MODE0;

}	

/* ------------------------------------------------------------ */
/***	DSPI::end
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Return the object to the uninitialized state and disable
**		the SPI controller.
*/

void
DSPI::end() {

	pspi->sxCon.reg = 0;	
	cbCur = 0;
	clearIntVector(vec);	
}

/* ------------------------------------------------------------ */
/***	DSPI::setSpeed
**
**	Parameters:
**		spd		- clock speed to set in HZ
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		This sets the SPI clock speed to the highest supported
**		frequency that doesn't exceed the requested value. It computes
**		the appropriate value to load into the SPI baud register
**		based on requested clock speed and peripheral bus frequency.
*/

void
DSPI::setSpeed(uint32_t spd) {

	uint16_t	brg;

	/* Compute the baud rate divider for this frequency.
	*/
	brg = (uint16_t)((__PIC32_pbClk / (2 * spd)) - 1);

	/* That the baud rate value is in the correct range.
	*/
	if (brg == 0xFFFF) {
		/* The user tried to set a frequency that is too high to support.
		** Set it to the highest supported frequency.
		*/
		brg = 0;
	}

	if (brg > 0x1FF) {
		/* The user tried to set a frequency that is too low to support.
		** Set it to the lowest supported frequency.
		*/
		brg = 0x1FF;
	}

	/* Write the value to the SPI baud rate register. Section 23. SPI
	** of the PIC32 Family Reference Manual says to disable the SPI
	** controller before writing to the baud register
	*/
	pspi->sxCon.clr = (1 << _SPICON_ON);	// disable SPI
	pspi->sxBrg.reg = brg;
	pspi->sxCon.set = (1 << _SPICON_ON);	// enable SPI

}

/* ------------------------------------------------------------ */
/***	DSPI::setMode
**
**	Parameters:
**		mod		- requested SPI mode.
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Set the SPI controller to the requested data mode. This
**		should be one of the values:
**			DSPI_MODE0, DSPI_MODE1, DSPI_MODE2, DSPI_MODE3
*/

void
DSPI::setMode(uint16_t mod) {

