chipKIT32/chipKIT32-MAX/hardware/pic32/libraries/DSPI/DSPI.cpp
/* ------------------------------------------------------------ */
/*					Interrupt Control Functions					*/
/* ------------------------------------------------------------ */
/***	enableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Sets up the interrupt controller and enables interrupts
**		for this SPI port.
*/

void
DSPI::enableInterruptTransfer() {

	 clearOverflow();			// clear the receive overflow error flag

	/* Clear the interrupt flags and then enable SPI interrupts. Don't enable the
	** transmit interrupt now. This will happen in the transfer function that 
	** begins a data transfer operation.
	*/
	pregIfs->clr = bitRx + bitTx + bitErr;		// clear all interrupt flags
	pregIec->set = bitRx + bitErr;				// enable interrupts

}

/* ------------------------------------------------------------ */
/***	disableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Turns off SPI interrupts for this SPI port.
*/

void
DSPI::disableInterruptTransfer() {

	/* Disable SPI interrupts and then clear the interrupt flags.
	*/
	pregIec->clr = bitRx + bitTx + bitErr;	// disable all interrupts
	pregIfs->clr = bitRx + bitTx + bitErr;	// clear all interrupt flags

}

/* ------------------------------------------------------------ */
/***	DSPI::cancelIntTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		This will cancel an interrupt driven transfer. It is still
**		the caller's responsibility to drive SS high to release
**		the slave device.
*/

void
DSPI::cancelIntTransfer() {

	uint8_t		bTmp;

	/* Clear the receive buffer.
	*/
	bTmp = pspi->sxBuf.reg;

	/* Clear the interrupt flags.
	*/
	pregIfs->clr = bitErr + bitRx + bitTx;

	/* Set the count of bytes remaining to 0.
	*/
	cbCur = 0;

}

/* ------------------------------------------------------------ */
/*					Interrupt Driven I/O Functions				*/
/* ------------------------------------------------------------ */
/***	DSPI::intTransfer
**
**	Parameters:
**		cbReq		- number of bytes to transfer
**		pbSnd		- pointer to buffer of bytes to transmit
**		pbRcv		- pointer to buffer to receive return bytes
**
**	Return Value:
**		none
**
**	Errors:
**		Overrun error handled in interrupt service routine
**
**	Description:
**		This function will set up and begin an interrupt driven
**		transfer where the received bytes are stored into a
**		receive buffer.
*/

void
DSPI::intTransfer(uint16_t cbReq, uint8_t * pbSnd, uint8_t * pbRcv) {

	/* Set up the control variables for the transfer.
	*/
	cbCur = cbReq;
	pbSndCur = pbSnd;
	pbRcvCur = pbRcv;

	/* Wait for the transmitter to be ready
	*/
	while ((pspi->sxStat.reg & (1 << _SPISTAT_SPITBE)) == 0) {
	}

	/* Send the first byte.
	*/
	pspi->sxBuf.reg = *pbSndCur++;

}

/* ------------------------------------------------------------ */
/***	DSPI::intTransfer
**
**	Parameters:
**		cbReq		- number of bytes to transfer
**		pbSnd		- pointer to buffer of bytes to transmit
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		This function will set up and begin an interrupt driven
**		transfer where the received bytes are discarded.
*/

void
DSPI::intTransfer(uint16_t cbReq, uint8_t * pbSnd) {

	/* Set up the control variables for the transfer.
	*/
	cbCur = cbReq;
	pbSndCur = pbSnd;
	pbRcvCur = 0;

	/* Wait for the transmitter to be ready
	*/
	while ((pspi->sxStat.reg & (1 << _SPISTAT_SPITBE)) == 0) {
	}

	/* Send the first byte.
	*/
	pspi->sxBuf.reg = *pbSndCur++;

}

/* ------------------------------------------------------------ */
/***	DSPI::intTransfer
**
**	Parameters:
**		cbReq		- number of bytes to receive
**		bPadT		- pad byte to send to the slave device
**		pbRcv		- pointer to buffer to receive returned bytes
**
**	Return Value:
**		none
**
**	Errors:
**		Overrun error handled by the interrupt service routine
**
**	Description:
**		This function will set up and begin an interrupt driven
**		transfer where there is no transmit buffer but the returned
**		bytes are stored. The given pad byte is sent to the slave
**		to cause the returned bytes to be sent by the slave.
*/

void
DSPI::intTransfer(uint16_t cbReq, uint8_t bPadT, uint8_t * pbRcv) {

	/* Set up the control variables for the transfer.
	*/
	cbCur = cbReq;
	pbSndCur = 0;
	pbRcvCur = pbRcv;
	bPad = bPadT;

	/* Wait for the transmitter to be ready
	*/
	while ((pspi->sxStat.reg & (1 << _SPISTAT_SPITBE)) == 0) {
	}

	/* Send the first byte.
	*/
	pspi->sxBuf.reg = bPad;

}

/* ------------------------------------------------------------ */
/***	DSPI::doDspiInterrupt
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		This function is called by the interrupt service routine
**		to handle SPI interrupts for this SPI port. It should only
**		be entered while performing an interrupt driven data
**		transfer operation.
*/

void
DSPI::doDspiInterrupt() {

	uint8_t		bTmp;
	uint32_t	regIfs;

	/* Get the interrupt flag status.
	*/
	regIfs = pregIfs->reg;

	/* Check for and handle overrun error interrupt.
	*/
	if ((regIfs & bitErr) != 0) {
		fRov = 1;				// set the receive overflow error flag;
		pspi->sxStat.clr = (1 << _SPISTAT_SPIROV);	//clear status bit
		pregIfs->clr = bitErr;
	}

	/* Check for and handle receive interrupt.
	*/
	if ((regIfs & bitRx) != 0) {

		/* Get the received character.
		*/
		bTmp = pspi->sxBuf.reg;		//read next byte from SPI controller
		cbCur -= 1;					//count this byte as received

		/* Are we storing it? pbRcvCur is 0 if we are sending only
		** and ignoring the received data.
		*/
		if (pbRcvCur != 0) {
			*pbRcvCur++ = bTmp;		//store the received byte into output buffer
		}

		/* Send the next byte to the slave. pbSndCur is 0 if we are
		** receiving only. In this case send the pad byte.
		*/
		if (cbCur > 0) {
			bTmp = (pbSndCur != 0) ? *pbSndCur++ : bPad;
			pspi->sxBuf.reg = bTmp;
		}

