chipKIT32/chipKIT32-MAX/hardware/pic32/libraries/DSPI/DSPI.cpp
		pregIfs->clr = bitRx;		//clear the receive interrupt flag

	}

}

/* ------------------------------------------------------------ */
/*				DSPI0 Object Class Implementation				*/
/* ------------------------------------------------------------ */

#if defined(_DSPI0_BASE)

/***	DSPI0::DSPI0
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Constructor.
*/

#if defined(__PIC32MX1XX__) || defined(__PIC32MX2XX__) || defined(__PIC32MZXX__) || defined(__PIC32MX47X__)
DSPI0::DSPI0() : DSPI(_DSPI0_MISO_PIN, _DSPI0_MOSI_PIN, _DSPI0_MISO_IN, _DSPI0_MOSI_OUT)
#else
DSPI0::DSPI0() 
#endif
{

	pspi = (p32_spi *) _DSPI0_BASE;
	vec = _DSPI0_VECTOR;
	ipl = ((_DSPI0_IPL & 0x07) << 2) + (_DSPI0_SPL & 0x03);
	pinSS = PIN_DSPI0_SS;

	init(_DSPI0_ERR_IRQ, _DSPI0_RX_IRQ, _DSPI0_TX_IRQ, IntDspi0Handler);
}

/* ------------------------------------------------------------ */
/***	enableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Sets up the interrupt controller and enables interrupts
**		for this SPI port.
*/

void
DSPI0::enableInterruptTransfer() {

	pdspi0 = this;
	DSPI::enableInterruptTransfer();
}

/* ------------------------------------------------------------ */
/***	disableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Turns off SPI interrupts for this SPI port.
*/

void
DSPI0::disableInterruptTransfer() {

	DSPI::disableInterruptTransfer();
	pdspi0 = 0;
}

#endif	// _DSPI0_BASE

/* ------------------------------------------------------------ */
/*				DSPI1 Object Class Implementation				*/
/* ------------------------------------------------------------ */

#if defined(_DSPI1_BASE)

/***	DSPI1::DSPI1
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Constructor.
*/

#if defined(__PIC32MX1XX__) || defined(__PIC32MX2XX__) || defined(__PIC32MZXX__) || defined(__PIC32MX47X__)
DSPI1::DSPI1() : DSPI(_DSPI1_MISO_PIN, _DSPI1_MOSI_PIN, _DSPI1_MISO_IN, _DSPI1_MOSI_OUT)
#else
DSPI1::DSPI1()
#endif
{

	pspi = (p32_spi *) _DSPI1_BASE;
	vec = _DSPI1_VECTOR;
	ipl = ((_DSPI1_IPL & 0x07) << 2) + (_DSPI1_SPL & 0x03);
	pinSS = PIN_DSPI1_SS;

	init(_DSPI1_ERR_IRQ, _DSPI1_RX_IRQ, _DSPI1_TX_IRQ, IntDspi1Handler);
}

/* ------------------------------------------------------------ */
/***	enableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Sets up the interrupt controller and enables interrupts
**		for this SPI port.
*/

void
DSPI1::enableInterruptTransfer() {

	pdspi1 = this;
	DSPI::enableInterruptTransfer();
}

/* ------------------------------------------------------------ */
/***	disableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Turns off SPI interrupts for this SPI port.
*/

void
DSPI1::disableInterruptTransfer() {


	DSPI::disableInterruptTransfer();
	pdspi1 = 0;
}

#endif	// _DSPI1_BASE

/* ------------------------------------------------------------ */
/*				DSPI2 Object Class Implementation				*/
/* ------------------------------------------------------------ */

#if defined(_DSPI2_BASE)

/***	DSPI2::DSPI2
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Constructor.
*/

#if defined(__PIC32MX1XX__) || defined(__PIC32MX2XX__) || defined(__PIC32MZXX__) || defined(__PIC32MX47X__)
DSPI2::DSPI2() : DSPI(_DSPI2_MISO_PIN, _DSPI2_MOSI_PIN, _DSPI2_MISO_IN, _DSPI2_MOSI_OUT)
#else
DSPI2::DSPI2()
#endif
{

	pspi = (p32_spi *) _DSPI2_BASE;
	vec = _DSPI2_VECTOR;
	ipl = ((_DSPI2_IPL & 0x07) << 2) + (_DSPI2_SPL & 0x03);
	pinSS = PIN_DSPI2_SS;

	init(_DSPI2_ERR_IRQ, _DSPI2_RX_IRQ, _DSPI2_TX_IRQ, IntDspi2Handler);
}

/* ------------------------------------------------------------ */
/***	enableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Sets up the interrupt controller and enables interrupts
**		for this SPI port.
*/

void
DSPI2::enableInterruptTransfer() {

	pdspi2 = this;
	DSPI::enableInterruptTransfer();
}

/* ------------------------------------------------------------ */
/***	disableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Turns off SPI interrupts for this SPI port.
*/

void
DSPI2::disableInterruptTransfer() {

	DSPI::disableInterruptTransfer();
	pdspi2 = 0;
}

#endif	// _DSPI2_BASE

/* ------------------------------------------------------------ */
/*				DSPI3 Object Class Implementation				*/
/* ------------------------------------------------------------ */

#if defined(_DSPI3_BASE)

/***	DSPI3::DSPI3
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Constructor.
*/

#if defined(__PIC32MX1XX__) || defined(__PIC32MX2XX__) || defined(__PIC32MZXX__) || defined(__PIC32MX47X__)
DSPI3::DSPI3() : DSPI(_DSPI3_MISO_PIN, _DSPI3_MOSI_PIN, _DSPI3_MISO_IN, _DSPI3_MOSI_OUT)
#else
DSPI3::DSPI3()
#endif
{

	pspi = (p32_spi *) _DSPI3_BASE;
	vec = _DSPI3_VECTOR;
	ipl = ((_DSPI3_IPL & 0x07) << 2) + (_DSPI3_SPL & 0x03);
	pinSS = PIN_DSPI3_SS;

	init(_DSPI3_ERR_IRQ, _DSPI3_RX_IRQ, _DSPI3_TX_IRQ, IntDspi3Handler);
}

/* ------------------------------------------------------------ */
/***	enableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Sets up the interrupt controller and enables interrupts
**		for this SPI port.
*/

void
DSPI3::enableInterruptTransfer() {

	pdspi3 = this;
	DSPI::enableInterruptTransfer();
}

/* ------------------------------------------------------------ */
/***	disableInterruptTransfer
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Turns off SPI interrupts for this SPI port.
*/

void
DSPI3::disableInterruptTransfer() {

	DSPI::disableInterruptTransfer();
	pdspi3 = 0;
}

