chipKIT32/chipKIT32-MAX/hardware/pic32/libraries/DSPI/DSPI.cpp
#endif	// _DSPI3_BASE

/* ------------------------------------------------------------ */
/*			Interrupt Service Routines							*/
/* ------------------------------------------------------------ */

extern "C" {

/* ------------------------------------------------------------ */
/***	IntDspi0Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine the SPI controller being used
**		logical SPI port DSPI0
*/
#if defined(_DSPI0_VECTOR)

#if defined(__PIC32MZXX__)
void __attribute__((nomips16,at_vector(_DSPI0_VECTOR),interrupt(_DSPI0_IPL_ISR))) IntDspi0Handler(void)
#else
void __attribute__((interrupt(), nomips16)) IntDspi0Handler(void)
#endif
{
	if (pdspi0 != 0) {
		pdspi0->doDspiInterrupt();
	}
}
#endif

/* ------------------------------------------------------------ */
/***	IntDspi1Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine the SPI controller being used
**		logical SPI port DSPI1
*/
#if defined(_DSPI1_VECTOR)

#if defined(__PIC32MZXX__)
void __attribute__((nomips16,at_vector(_DSPI1_VECTOR),interrupt(_DSPI1_IPL_ISR))) IntDspi1Handler(void)
#else
void __attribute__((interrupt(), nomips16)) IntDspi1Handler(void)
#endif
{
	if (pdspi1 != 0) {
		pdspi1->doDspiInterrupt();
	}
}
#endif

/* ------------------------------------------------------------ */
/***	IntDspi2Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine the SPI controller being used
**		logical SPI port DSPI2
*/
#if defined(_DSPI2_VECTOR)

#if defined(__PIC32MZXX__)
void __attribute__((nomips16,at_vector(_DSPI2_VECTOR),interrupt(_DSPI2_IPL_ISR))) IntDspi2Handler(void)
#else
void __attribute__((interrupt(), nomips16)) IntDspi2Handler(void)
#endif
{
	if (pdspi2 != 0) {
		pdspi2->doDspiInterrupt();
	}
}
#endif

/* ------------------------------------------------------------ */
/***	IntDspi3Handler
**
**	Parameters:
**		none
**
**	Return Value:
**		none
**
**	Errors:
**		none
**
**	Description:
**		Interrupt service routine the SPI controller being used
**		logical SPI port DSPI3
*/
#if defined(_DSPI3_VECTOR)

#if defined(__PIC32MZXX__)
void __attribute__((nomips16,at_vector(_DSPI3_VECTOR),interrupt(_DSPI3_IPL_ISR))) IntDspi3Handler(void)
#else
void __attribute__((interrupt(), nomips16)) IntDspi3Handler(void)
#endif
{
	if (pdspi3 != 0) {
		pdspi3->doDspiInterrupt();
	}
}
#endif

};		// extern "C"

/* ------------------------------------------------------------ */

/************************************************************************/

